AE(
  (encoder): Sequential(
    (linear1): Linear(in_features=2048, out_features=1024, bias=True)
    (batchnorm1): BatchNorm1d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu1): ReLU()
    (linear2): Linear(in_features=1024, out_features=512, bias=True)
    (batchnorm2): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu2): ReLU()
    (linear3): Linear(in_features=512, out_features=256, bias=True)
    (batchnorm3): BatchNorm1d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu3): ReLU()
    (linear4): Linear(in_features=256, out_features=128, bias=True)
    (batchnorm4): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu4): ReLU()
  )
  (decoder): Sequential(
    (linear5): Linear(in_features=128, out_features=248, bias=True)
    (batchnorm5): BatchNorm1d(248, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu5): ReLU()
    (linear6): Linear(in_features=248, out_features=512, bias=True)
    (batchnorm6): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu6): ReLU()
    (linear7): Linear(in_features=512, out_features=1024, bias=True)
    (batchnorm7): BatchNorm1d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu7): ReLU()
    (linear8): Linear(in_features=1024, out_features=2048, bias=True)
    (batchnorm8): BatchNorm1d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (relu8): ReLU()
  )
)
Adam (
Parameter Group 0
    amsgrad: False
    betas: (0.9, 0.999)
    capturable: False
    eps: 1e-08
    foreach: None
    lr: 0.0004
    maximize: False
    weight_decay: 0.0001
)
Test Loss Normal: 0.0001224137875033634
Test Loss Anomalous: 0.0001341980103331002
Time taken by 1 epochs: 1.5735560337702432Thresholds are: tensor([1.0000e+00, 3.3732e-04, 3.3729e-04,  ..., 4.1450e-05, 4.1432e-05,
        4.0829e-05])